{
    "team":
    [
        {
            "title": "Armand Ohoungnon",
            "name": "PPC Specialist",
            "description": "10+ years of experience in digital marketing. Expertise in SEO, PPC, and content strategy",
            "profile": "/team/c1.png",
            "link": "/"
        },
       
        {
            "title": "Francesco Monopoli",
            "name": "Catalog Specialist",
            "description": "7+ years of experience in project management and team leadership. Strong organizational and communication skills",
            "profile": "/team/c2.png",
            "link": "/"
        },
        {
            "title": "Sali Leshi",
            "name": "Design Specialist",
            "description": "5+ years of experience in SEO and content creation. Proficient in keyword research and on-page optimization",
            "profile": "/team/c3.png",
            "link": "/"
        }

    ], 
    
    "process":
    [
        {
            "label": "Audit Gratuito Account Amazon Seller o Vendor",
            "content": "Offriamo un servizio di audit completo per venditori e vendor su Amazon, mirato a ottimizzare prestazioni e vendite. Analizziamo le prestazioni dell'account, l'ottimizzazione SEO e la qualità delle immagini dei prodotti. Verifichiamo i contenuti del marchio e l'efficacia delle campagne pubblicitarie, fornendo un report dettagliato con raccomandazioni pratiche per migliorare il tuo account e raggiungere il successo su Amazon. Senza il nostro supporto, potresti non sfruttare appieno il potenziale del tuo account, lasciando spazio a inefficienze e opportunità mancate che possono influire sulla crescita e sulle vendite."
        },
        {
            "label": "Ottimizzazione Catalogo Amazon, Content A+, Brand Story A+ e Vetrina Del Brand",
            "content": "Il nostro processo di ottimizzazione su Amazon massimizza le conversioni e le vendite del tuo account. Iniziamo con una ricerca approfondita delle parole chiave e un'analisi competitiva degli ASIN. Creiamo e regoliamo varianti di prodotto, ottimizziamo SEO degli annunci e miglioriamo le immagini delle inserzioni con il nostro team di grafici. Inoltre, perfezioniamo i contenuti del marchio per garantire descrizioni coinvolgenti. Su richiesta, collaboriamo con i grafici dell'azienda del brand. Questo approccio integrato assicura che ogni aspetto del tuo account sia ottimizzato per massimizzare visibilità, conversioni e vendite su Amazon."
        },
        {
            "label": "Avvio e Ottimizzazione Campagne Pubblicitarie Amazon Awareness, Considerazione e Conversione",
            "content": "Il nostro processo pubblicitario su Amazon massimizza le prestazioni delle campagne. Effettuiamo un'analisi dei concorrenti, ricerchiamo parole chiave e sviluppiamo una strategia di campagne personalizzata. Ottimizziamo e monitoriamo costantemente le campagne per raggiungere i target ACOS/TACOS, apportando aggiustamenti continui per garantire l'efficienza del budget e il massimo ritorno sull'investimento."
        },
        {
            "label": "Monitoraggio KPI & Analisi Dati Amazon",
            "content": "Ottimizziamo e analizziamo ogni aspetto della vendita su Amazon per prendere decisioni informate che ottimizzano i tuoi annunci. Utilizzando tecniche basate sui dati, come il test A/B e il miglioramento dei dati di conversione, ti aiutamo a vendere di più su Amazon."
        },
        {
            "label": "Gestione Pratiche Con Amazon Seller Support",
            "content": "Ci occupiamo della completa gestione di Amazon Seller Central. Apriamo, monitoriamo e chiudiamo i ticket necessari al fine di risolvere eventuali problematiche o situazioni con Amazon Seller Support."
        },
        {
            "label": "Ripetizione Del Processo",
            "content": ""
        }
    ]
}